Repository: AserDen/ALSTOM_Alarm_Matrix
Catalog: lib/l10n/app_*.arb
Languages: it, ru, sr

# settingsTitle
source: Settings
it: Impostazioni
ru: Настройки
sr: Podešavanja

# searchHint
source: Search: fault number / text / alarm item / designation...
it: Cerca: numero guasto / testo / alarm item / designation...
ru: Поиск: номер аварии / текст / alarm item / designation...
sr: Pretraga: broj kvara / tekst / alarm item / designation...

# allSubsets
source: All
it: Tutti
ru: Все
sr: Svi

source: Only with ALARM ITEM
it: Solo con ALARM ITEM
ru: Только с ALARM ITEM
sr: Samo sa ALARM ITEM

# noRecords
source: No records. Import Excel in Settings.
it: Nessun record. Importa l'Excel nelle Impostazioni.
ru: Нет записей. Импортируйте Excel в Настройках.
sr: Nema zapisa. Uvezite Excel u Podešavanjima.

# faultTitle
source: Fault #{faultNumber}
it: Guasto #{faultNumber}
sr: Kvar #{faultNumber}

source: Not found
it: Non trovato
ru: Не найдено
sr: Nije pronađeno

# otherFields
source: Other fields (raw)
it: Altri campi (raw)
ru: Другие поля (raw)
sr: Ostala polja (raw)

# rawJsonInvalid
source: rawJson is not valid JSON
it: rawJson non è un JSON valido
ru: rawJson не является корректным JSON
sr: rawJson nije validan JSON

source: Notes
it: Note
ru: Заметки
sr: Beleške

# addNoteHint
source: Add note...
it: Aggiungi nota...
ru: Добавить заметку...
sr: Dodaj belešku...

# addNoteButton
source: Add note
it: Aggiungi nota
ru: Добавить заметку
sr: Dodaj belešku

source: No notes yet.
it: Nessuna nota ancora.
ru: Заметок пока нет.
sr: Još nema beleški.

# importExcel
source: Import Excel (.xlsx)
it: Importa Excel (.xlsx)
ru: Импорт Excel (.xlsx)
sr: Uvezi Excel (.xlsx)

# dataSection
source: Data
it: Dati
ru: Данные
sr: Podaci

# importedRows
source: Imported: {count} rows
it: Importati: {count} righe
ru: Импортировано: {count} строк
sr: Uvezeno: {count} redova

# importError
source: Import error: {error}
it: Errore di importazione: {error}
ru: Ошибка импорта: {error}
sr: Greška pri uvozu: {error}

# importTip
source: Tip: Prefer alarm_matrix_analysis.xlsx (Sheet1_clean) for stable headers. Fallback: sheet "1" is also supported.
it: Suggerimento: preferisci alarm_matrix_analysis.xlsx (Sheet1_clean) per intestazioni stabili. È supportato anche il foglio "1".
ru: Совет: используйте alarm_matrix_analysis.xlsx (Sheet1_clean) для стабильных заголовков. Также поддерживается лист "1".
sr: Savet: koristite alarm_matrix_analysis.xlsx (Sheet1_clean) za stabilne zaglavlja. Podržan je i list "1".

# subsetLoadError
source: Subset load error: {error}
it: Errore di caricamento subset: {error}
ru: Ошибка загрузки subset: {error}
sr: Greška pri učitavanju subset-a: {error}

# faultsError
source: Error: {error}
it: Errore: {error}
ru: Ошибка: {error}
sr: Greška: {error}

# notesError
source: Notes error: {error}
it: Errore note: {error}
ru: Ошибка заметок: {error}
sr: Greška beleški: {error}
